# TODO: 仕事用でしか使わないパッケージとかも定義しておきたい
# できる限りインストールする数は減らしておけると便利だし、依存関係も減らせる
# 初期にインストールするものだけシンプルに追加しておいて、必要に応じてbrew installとかした方がいいんじゃないか？

brew "git"
brew "asdf"
brew "jq"
brew "tree"
brew "fzf"
brew "tmux"
brew "gh" # github cli
brew "chezmoi"
brew "neovim"
brew "gpg"
brew "rust"
brew "rustfmt"
brew "ripgrep" # grepするツールかな？Telescopeのlive_grepで使用するため入れている
brew "zplug"
brew "starship" # クロスシェル対応の高速プロンプト
brew "kubectx" # kubectlのcontext/namespace切り替えツール（fzf統合）
brew "go"
brew "azure-cli"
brew "helm"
brew "kubectl"
brew "oven-sh/bun/bun"
brew "deno"
# tap "hashicorp/tap"
# brew "hashicorp/tap/terraform"
brew "tfenv" # tfenvでterraformのバージョン管理をする

# optional
# brew "swift-format"
# brew "awscli"
# brew "minio/stable/mc"
# brew "fastlane"
# brew "openjdk"

{{ if eq .chezmoi.os "darwin" -}}
tap "dashlane/tap"
tap "heroku/brew"
cask_args appdir: "/Applications"
brew "mas" # ターミナルからApp Storeのアプリをインストールできるようにするやつ
brew "pinentry-mac" # gpgのパスフレーズ入力用
brew "dashlane-cli" # dashlaneのcli版。chezmoiで機密情報を埋め込むのに使う
brew "yarn" # dashlane-cliの依存関係として必要
brew "heroku/brew/heroku" # Heroku CLI
brew "kind" # kubernetes in docker

## caskを使うとMacのGUIアプリをインストールできる
cask "slack"
cask "appcleaner"
cask "docker-desktop"
cask "notion"
cask "ticktick"
cask "rectangle"
cask "the-unarchiver"
cask "visual-studio-code"
cask "dropbox"
cask "chatgpt"
cask "github"
cask "discord"
cask "vivaldi"
cask "google-chrome"
cask "tableplus"
cask "ogdesign-eagle"
# cask "virtualbox" // m1, m2だと動かないintel系のみらしい。別途インストールしないとかも。
cask "postman"
cask "unity-hub"
cask "zoom"
cask "kindle"
cask "wireshark-app"
cask "spotify"
cask "fl-studio"
cask "font-hack-nerd-font" # Nerd Font (アイコン表示対応)
cask "copilot-for-xcode"
cask "ticktick"
cask "wezterm"
cask "blender"
cask "gitbutler"
# 基本的にcaskでインストールできるならcaskでいいかなって思う
mas "LINE", id: 539883307

{{ end -}}
