# 開発用パッケージ
# 言語ランタイム、ツールチェーン

brew "mise"
brew "go"
brew "rust"
brew "rustfmt"
brew "deno"
brew "oven-sh/bun/bun"
brew "biome"
brew "tree"
brew "tmux"
brew "gpg"

# Kubernetes
brew "kubectl"
brew "kubectx"
brew "kubeseal"
brew "helm"
brew "kind"

# IaC
brew "tfenv"
