# macOS用 GUIアプリ
# 必要に応じて追加・削除

tap "heroku/brew"
cask_args appdir: "/Applications"

# ユーティリティ
brew "mas"
brew "pinentry-mac"
brew "dashlane/tap/dashlane-cli"
brew "yarn"
brew "heroku/brew/heroku"

# 基本アプリ
cask "wezterm"
cask "visual-studio-code"
cask "docker-desktop"
cask "rectangle"
cask "appcleaner"
cask "the-unarchiver"

# 開発ツール
cask "github"
cask "tableplus"
cask "postman"

# ブラウザ
cask "google-chrome"
cask "vivaldi"

# コミュニケーション
cask "slack"
cask "discord"
cask "zoom"

# 生産性
cask "notion"
cask "ticktick"
cask "chatgpt"
cask "dropbox"

# クリエイティブ
cask "spotify"
cask "fl-studio"
cask "blender"
cask "unity-hub"
cask "ogdesign-eagle"

# その他
cask "kindle"
cask "wireshark-app"
cask "gitbutler"
cask "copilot-for-xcode"
cask "font-hack-nerd-font"

mas "LINE", id: 539883307
